"""Emoji

Available Commands:

.police

if u edit it then u r gay"""

from telethon import events

import asyncio





@borg.on(events.NewMessage(pattern=r"\.(.*)", outgoing=True))

async def _(event):

    if event.fwd_from:

        return

    animation_interval = 0.3

    animation_ttl = range(0, 12)

    input_str = event.pattern_match.group(1)

    if input_str == "police":

        await event.edit(input_str)

        animation_chars = [
        
            "ðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ\nðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ\nðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ",
            "ðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´\nðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´\nðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´",
            "ðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ\nðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ\nðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ",
            "ðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´\nðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´\nðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´",
            "ðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ\nðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ\nðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ",    
            "ðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´\nðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´\nðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´",
            "ðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ\nðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ\nðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ",
            "ðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´\nðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´\nðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´",
            "ðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ\nðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ\nðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ",
            "ðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´\nðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´\nðŸ”µðŸ”µðŸ”µâ¬œâ¬œâ¬œðŸ”´ðŸ”´ðŸ”´",
            "ðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ\nðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ\nðŸ”´ðŸ”´ðŸ”´â¬œâ¬œâ¬œðŸ”µðŸ”µðŸ”µ",
            "BotHub **Police is Chasing you now**"

 ]

        for i in animation_ttl:

            await asyncio.sleep(animation_interval)

            await event.edit(animation_chars[i % 12])
